Revit 2027 API
Element.Document Property
Returns the Document in which the Element resides.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Document Document { get; }
Public ReadOnly Property Document As Document
	Get
public:
property Document^ Document {
	Document^ get ();
}
member Document : Document with get
Property Value
Document
Remarks
All elements are contained within a document. An element can be retrieved from this document by using the id that is returned by the element's id property.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace